; domain
;; Shakey world (domain)

(define (domain shakey)
	(:requirements :strips)
	(:predicates
		(in ?what ?where)
		(adj ?r-1 ?r-2)
		(is-robot ?what)
		(is-switch ?what)
		(is-box ?what)
		(wide-door ?r-1 ?r-2)
		(lights-on ?r)
	)

	(:action move
		:parameters (?who ?from ?to)
		:precondition (and (is-robot ?who)
				    (in ?who ?from)
				    (adj ?from ?to)
				)
		:effect (and (not (in ?who ?from)) (in ?who ?to))
	)

	(:action move-box
		:parameters (?box ?robot ?from ?to)
		:precondition (and (is-robot ?robot)
				   (is-box ?box)
				   (in ?robot ?from)
				   (in ?box ?from)
				   (adj ?from ?to)
				   (wide-door ?from ?to)
			      )
		:effect (and (not (in ?robot ?from)) (in ?robot ?to)
			     (not (in ?box ?from)) (in ?box ?to)
			)
	)

	(:action turn-on-light
		:parameters (?box ?robot ?switch ?room)
		:precondition (and (is-robot ?robot)
				   (is-box ?box)
				   (is-switch ?switch)
				   (in ?robot ?room)
				   (in ?box ?room)
				   (in ?switch ?room)
			      )
		:effect (lights-on ?room)
	)
)

; problem
;; Shakey (problem)

(define (problem shakey-1)
	(:domain shakey)
	(:objects room-1 room-2 room-3
		box robot switch-1 switch-2
		switch-3	
	)

	(:init (adj room-1 room-2)
		(adj room-2 room-1)
		(adj room-2 room-3)
		(adj room-3 room-2)
		(wide-door room-1 room-2)
		(wide-door room-2 room-1)		
		(wide-door room-2 room-3)
		(wide-door room-3 room-2)
		(in box room-1)
		(is-box box)
		(in robot room-2)
		(is-robot robot)
		(in switch-1 room-1)
		(is-switch switch-1)
		(in switch-2 room-2)
		(is-switch switch-2)
		(in switch-3 room-3)
		(is-switch switch-3)
		(not (lights-on room-1))
		(not (lights-on room-2))
		(not (lights-on room-3))
	)

	(:goal (and (lights-on room-1) (lights-on room-2) (lights-on room-3))
	)
				
)

; plan
1. (move robot room-2 room-1)
   deleted: (in robot room-2)
   added: (in robot room-1)
   goals met: 0 of 3
2. (turn-on-light box robot switch-1 room-1)
   added: (lights-on room-1)
   goals met: 1 of 3
3. (move-box box robot room-1 room-2)
   deleted: (in robot room-1) (in box room-1)
   added: (in robot room-2) (in box room-2)
   goals met: 1 of 3
4. (turn-on-light box robot switch-2 room-2)
   added: (lights-on room-2)
   goals met: 2 of 3
5. (move-box box robot room-2 room-3)
   deleted: (in robot room-2) (in box room-2)
   added: (in robot room-3) (in box room-3)
   goals met: 2 of 3
6. (turn-on-light box robot switch-3 room-3)
   added: (lights-on room-3)
   goals met: 3 of 3
